app/Http/Controllers/Admin/Home/IndexController.php

    public function index()
    {
        $productos = Producto::count();
        $categorias = Categoria::count();
        $marcas = Marca::count();
        $pedidos = Pedido::count();
---
select count(*) as aggregate from `producto`
select count(*) as aggregate from `categoria` where `categoria`.`deleted_at` is null
select count(*) as aggregate from `marca`
select count(*) as aggregate from `pedidos`