app/Http/Controllers/Admin/Categorias/ActualizarController.php

    public function actualizar(Request $request)
    {
        $categoria = Categoria::where('id',$request->id)->update(['nombre' => $request->nombre ]);
---
update `categoria` set `nombre` = 'CELULARES', `updated_at` = '2017-08-25 21:21:39' where `id` = '1' and `categoria`.`deleted_at` is null