app/Http/Controllers/Admin/Categorias/EditarController.php

    public function index($id)
    {
        $categoria = Categoria::where('id',$id)->get();
---
select * from `categoria` where `id` = '1' and `categoria`.`deleted_at` is null