app/Http/Controllers/Admin/Categorias/EliminarController.php

    public function index($id)
    {
        Categoria::where('id',$id)->delete();
---
update `categoria` set `deleted_at` = '2017-08-25 14:47:29', `updated_at` = '2017-08-25 14:47:29' where `id` = '1' and `categoria`.`deleted_at` is null