app/Http/Controllers/Admin/Categorias/ListadoController.php

    public function listado()
    {
        $Lista = Categoria::all();
---
select * from `categoria` where `categoria`.`deleted_at` is null