app/Http/Controllers/Admin/Categorias/RegistrarController.php

    public function index(RegistrarCategoriaRequest $request)
    {
        $data = new Categoria();
        $data->nombre = $request->nombre;
        $data->idusuario = 1;
        $data->save();
---
insert into `categoria` (`nombre`, `idusuario`, `updated_at`, `created_at`) values ('PRUEBA', '1', '2017-08-25 21:21:33', '2017-08-25 21:21:33')