app/Http/Controllers/Admin/Usuarios/ActualizarController.php

    public function index(Request $request)
    {
        if($request->has('password'))
        {
            User::where('id',$request->id)->update([
                            'nombres' => $request->nombres,
                            'paterno' => $request->paterno,
                            'materno' => $request->materno,
                            'email' => $request->email,
                            'password' => $request->password
                            ]);
            return redirect('usuarios')->with('messages','<div class="alert alert-info alert-dismissible" role="alert"><button type="button" class="close" data-dismiss="alert" aria-label="Close"><span aria-hidden="true">&times;</span></button>Usuario Actualizado.</div>');
        }else
        {
            User::where('id',$request->id)->update([
                            'nombres' => $request->nombres,
                            'paterno' => $request->paterno,
                            'materno' => $request->materno,
                            'email' => $request->email
                            ]);
---
update `users` set `nombres` = 'LISBET TAMARA 2', `paterno` = 'PEBE', `materno` = 'CHANCAN', `email` = 'lisbet@hotmail.com', `updated_at` = '2017-08-25 22:10:36' where `id` = '2'