app/Http/Controllers/Admin/Usuarios/EditarController.php

select * from `users` where `id` = '1' and `users`.`deleted_at` is null
---
    public function index($id)
    {
        $usuario = User::where('id',$id)->get();