app/Http/Controllers/Admin/Usuarios/EliminarController.php

delete from `users` where `id` = '2'
---
    public function index($id)
    {
        User::where('id',$id)->delete();