app/Http/Controllers/Admin/Usuarios/ListadoController.php

    public function listado()
    {
        $Lista = User::all();
---
select * from `users` where `users`.`deleted_at` is null