app/Http/Controllers/Admin/Usuarios/RegistrarController.php

    public function index(RegistrarRequest $request)
    {
        $data = new User();
        $data->paterno = strtoupper($request->paterno);
        $data->materno = strtoupper($request->materno);
        $data->nombres = strtoupper($request->nombres);
        $data->email = $request->email;
        $data->password = bcrypt($request->password);
        $data->roles = 'administrador';
        $data->save();
---
insert into `users` (`paterno`, `materno`, `nombres`, `email`, `password`, `roles`, `updated_at`, `created_at`) values ('PEBE', 'CHANCAN', 'LISBET TAMARA', 'lisbet_tamara@hotmail.com', 'y$ww8GmC89E.VvncisiCS1KOR4DGFUA.xCZc6CEIOVx.DEkLjhUjdYi', 'administrador', '2017-08-25 21:41:44', '2017-08-25 21:41:44')