app/Http/Controllers/Admin/Marcas/EliminarController.php

delete from `marca` where `id` = '3'
update `marca` set `deleted_at` = '2017-08-25 22:39:00', `updated_at` = '2017-08-25 22:39:00' where `id` = '1' and `marca`.`deleted_at` is null
---
    public function index($id)
    {
        Marca::where('id',$id)->delete();