app/Http/Controllers/Admin/Marcas/ListadoController.php

    public function index()
    {
        $lista = Marca::all();
---
select * from `marca` where `marca`.`deleted_at` is null